       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXO03.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

       01  ENREG.
           02 CodeEnreg PIC X(3)
           03 MATRICULE.
               NUMERO SERVICE PIC X(3)
               NUMERO PERSONNE  PIC X(4)
           03 NOM-PRENOM PIC X (24)
           03 SECURITE
